import controller as c
## 24.01.23
## Надо придумать первый запуск, чтоб сгенерировал пару файлов с школьными предметами
## В целом, основная задача выполнена, как мне кажется
## Программа может:
## *Добавить ученика, и сразу добавляет его имя во все файлы с предметами
## *Добавить предмет, сразу добавляет файл для записи данных всех учеников
## *Добавить оценку нужному ученику по нужному предмету
## *Показать список всех учеников
## *Показать оценки выбранного ученика по всем предметам
## *Добавить 5 случайный оценок каждому ученику по каждому предмету
##
## Пока не добавил:
## *Среднюю оценку ученика
## *Среднюю оценку всех учеников по каждому предмету
## *Претендентов на медали
##
##
c.Start()