# 24.01.23
# Программа может:
# *Добавить ученика, и сразу добавляет его имя во все файлы с предметами
# *Добавить предмет, сразу добавляет файл для записи данных всех учеников
# *Добавить оценку нужному ученику по нужному предмету
# *Добавить 5 случайный оценок каждому ученику по каждому предмету
#
# *Показать список всех учеников
# *Показать оценки выбранного ученика по всем предметам
#
# 26.01.23
# *Показать среднюю оценку ученика по каждому предмету
# *Показать среднюю оценку каждого ученика по конкретному языку

import controller as c

c.Start()